//Напишите программу, которая выводит на экран «5,4,3,2,1» используя цикл for.
public class Vstroky {
    public static void main(String[]args) {
        for (int a=5; a>=1; a--) {
            System.out.print(a+","+" ");
        }
    }
}
